





// Доработать форму регистрации из прошлых заданий, сделав для нее валидацию через JS. 
// ### Вопросы 💎

// 1. Чем отличаются куки, localStorage и sessionStorage?
// Что стоит использовать, если нам нужно надолго сохранить много пользовательских данных? - localStorage
// 2. Как добавить и получить значение из веб-хранилища? 
// 3. Придумайте еще минимум 3 ситуации помимо предложенных в уроке, для чего может быть нужно сохранять данные пользователя и какие? 
//     *Пример из урока: запомнить, что пользователь уже залогинился, что у него лежит в корзине или в каком разделе сайта он сейчас находится*
// 4. Как сделать валидацию номера кредитной карты? 
// 5. Как сделать input, который будет принимать только числа (минимум 2 способа)?
// 6. Найдите регулярное выражение для ФИО на русском языке
// 7. Как должно выглядеть невалидное поле, чтобы пользователю было понятно, что в него вводить? Как показать пользователю, что не так, если ввод некорректен (теги и атрибуты html, псевдоклассы css) ?
// *вопрос теоретический, код писать не надо*
// 8. Какие есть недостатки у стандартного способа задания валидации через HTML5?